/*******************************************************************************
                            Realizado por |ArgA|MIV
*******************************************************************************/

params ["_string"];

if (typeName _string != "STRING") exitWith { _string };

private _vowelsArray = [["A",["À","Á","Â","Ã","Ä","Å"]],["E",["È","É","Ê","Ë"]],["I",["Ì","Í","Î","Ï"]],["O",["Ò","Ó","Ô","Õ","Ö"]],["U",["Ù","Ú","Û","Ü"]],["a",["à","á","â","ã","ä","å"]],["e",["è","é","ê","ë"]],["i",["ì","í","î","ï"]],["o",["ò","ó","ô","õ","ö"]],["u",["ù","ú","û","ü"]]];
private _character   = [];
private _vowel       = [];
private _parseString = "";

{
	_character = toString [_x];
	_vowel = (( _vowelsArray select {_character in (_x select 1) } ) select 0) select 0;
	_parseString = format["%1%2",_parseString,  if (isNil "_vowel") then {_character} else {_vowel}];
	
} forEach toArray _string;

_parseString;

/*******************************************************************************
                            Realizado por |ArgA|MIV
*******************************************************************************/

//[_string] call MIV_fnc_log;

//"ÀÁÂÃÄÅÈÉÊËÌÍÎÏÒÓÔÕÖÙÚÛÜàáâãäåèéêëìíîïòóôõöùúûü"

/*

A:	065	a:	097
E:	069	e:	101
I:	073	i:	105
O:	079	o:	111
U:	085	u:	117

À:	192	à:	224
Á:	193	á:	225
Â:	194	â:	226
Ã:	195	ã:	227
Ä:	196	ä:	228
Å:	197	å:	229

È:	200	è:	232
É:	201	é:	233
Ê:	202	ê:	234
Ë:	203	ë:	235

Ì:	204	ì:	236
Í:	205	í:	237
Î:	206	î:	238
Ï:	207	ï:	239

Ò:	210	ò:	242
Ó:	211	ó:	243
Ô:	212	ô:	244
Õ:	213	õ:	245
Ö:	214	ö:	246

Ù:	217	ù:	249
Ú:	218	ú:	250
Û:	219	û:	251
Ü:	220	ü:	252

*/
